Documents/СведенияОНезачисленнойЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СведенияОНезачисленнойЗарплате</Name>
			<Comment>АПК:93 представления объекта и списка совпадают</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛПеречисленный</xr:Item>
				<xr:Item>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиАкционерами</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛКПеречислению</xr:Item>
				<xr:Item>AccumulationRegister.ЗарплатаКВыплатеАвансом</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.СведенияОДоходахНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.ЗарплатаКВыплате</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСБюджетомПоНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыПеречислением</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьПрочихДоходовВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьПрочихДоходовПеречислением</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58 физлицо является сотрудником</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СведенияОНезачисленнойЗарплате/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Сотрудники.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Проверяет есть ли документы по ведомости.
// 
// Параметры:
//	Ведомость - ДокументСсылка
//	Проведен  - Булево, Неопределено - если указано Неопределено, то проведенность не важна.
//
// Возвращаемое значение:
//	Булево - Истина - есть документ по ведомости.
//
Функция ЕстьПоВедомости(Ведомость, Проведен = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("Проведен", Проведен);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьНезачисленияПоВедомости
	|ИЗ
	|	Документ.СведенияОНезачисленнойЗарплате КАК НезачислениеЗарплаты
	|ГДЕ
	|	НезачислениеЗарплаты.Ведомость = &Ведомость
	|	И НЕ НезачислениеЗарплаты.ПометкаУдаления";
	Если Проведен <> Неопределено Тогда
		Схема = Новый СхемаЗапроса();
		Схема.УстановитьТекстЗапроса(Запрос.Текст);
		Схема.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(
			?(Проведен, "НезачислениеЗарплаты.Проведен", "НЕ НезачислениеЗарплаты.Проведен"));
		Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	КонецЕсли;	
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Выбирает документы по ведомости.
// 
// Параметры:
//	Ведомость - ДокументСсылка
//	Проведен  - Булево, Неопределено - если указано Неопределено, то проведенность не важна.
//
// Возвращаемое значение:
//	Массив - документы по ведомости (ДокументСсылка.СведенияОНезачисленнойЗарплате).
//
Функция ВыбратьПоВедомости(Ведомость, Проведен = Неопределено, ТолькоРазрешенные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НезачислениеЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СведенияОНезачисленнойЗарплате КАК НезачислениеЗарплаты
	|ГДЕ
	|	НезачислениеЗарплаты.Ведомость = &Ведомость
	|	И НЕ НезачислениеЗарплаты.ПометкаУдаления";
	Если Проведен <> Неопределено Тогда
		Схема = Новый СхемаЗапроса();
		Схема.УстановитьТекстЗапроса(Запрос.Текст);
		Схема.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(
			?(Проведен, "НезачислениеЗарплаты.Проведен", "НЕ НезачислениеЗарплаты.Проведен"));
		Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	КонецЕсли;	
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")
	
КонецФункции	

// Осуществляет поиск документов по ведомости.
// 
// Параметры:
//	Ведомость - ДокументСсылка
//	Проведен - Булево, Неопределено - если указано Неопределено, то проведенность не важна.
//
// Возвращаемое значение:
//	Массив - документы по ведомости (ДокументСсылка.СведенияОНезачисленнойЗарплате).
//
Функция НайтиПоВедомости(Ведомость, Проведен = Неопределено, ТолькоРазрешенные = Ложь) Экспорт
	
	ДокументыПоВедомости = ВыбратьПоВедомости(Ведомость, Проведен, ТолькоРазрешенные);
	
	Если ДокументыПоВедомости.Количество() = 0 Тогда
		Возврат ПустаяСсылка();
	Иначе	
		Возврат ДокументыПоВедомости[0];
	КонецЕсли;
	
КонецФункции	

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	Возврат 
		ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(
			Метаданные.Документы.СведенияОНезачисленнойЗарплате);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура УстановитьВозвратныеВидыВзаиморасчетов(ПараметрыОбновления = Неопределено) Экспорт
	ВзаиморасчетыССотрудниками.УстановитьВозвратныеВидыВзаиморасчетовДокумента(Метаданные.Документы.ПодтверждениеЗачисленияЗарплаты, ПараметрыОбновления); 
КонецПроцедуры

#КонецОбласти

#КонецОбласти
#КонецЕсли
